Tekla Open API Reference for Tekla Structures 2025
Frame.Type Property
 The frame's type (square, round, dashed...).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FrameTypes Type { get; set; }
Public Property Type As FrameTypes
	Get
	Set
Property Value
Type: FrameTypes
See Also
Reference
Frame Class
Tekla.Structures.Drawing Namespace